---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBottomDir2Generic
source: html/6cc0857d-591d-b559-9796-0724d85d4cea.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBottomDir2Generic Property

"Bottom/Interior Minor Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemBarTypeBottomDir2Generic { get; }
```